app/controllers/panels_controller.rb

SELECT "panels".* FROM "panels"
---
    def get_data
        @panel = Panel.all

INSERT INTO "panels" ("content", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["content", "Winter is Coming"], ["created_at", "2024-01-09 10:29:26.974003"], ["updated_at", "2024-01-09 10:29:26.974003"]]
---
      def create
        content = params[:_json]
      #  puts "========= params #{params[:_json]} content: #{content}"
       @panel = Panel.new(content:content)
        res_json = {}
        begin
          @panel.save!